====================================================================================================
Layer (type:depth-idx)                             Output Shape              Param #
====================================================================================================
OneShot_STGCN_2S                                   [32, 2]                   --
├─StreamSpatialTemporalGraph: 1-1                  [32, 128]                 2,940
│    └─BatchNorm1d: 2-1                            [32, 42, 30]              84
│    └─STGCN_Layer: 2-2                            [32, 32, 30, 14]          --
│    │    └─GraphConvolution: 3-1                  [32, 32, 30, 14]          384
│    │    └─Sequential: 3-2                        [32, 32, 30, 14]          9,376
│    │    └─ReLU: 3-3                              [32, 32, 30, 14]          --
│    └─OneShot_STGCN_Block: 2-3                    [32, 128, 30, 14]         --
│    │    └─ModuleDict: 3-4                        --                        50,176
├─StreamSpatialTemporalGraph: 1-2                  [32, 128]                 2,940
│    └─BatchNorm1d: 2-4                            [32, 28, 29]              56
│    └─STGCN_Layer: 2-5                            [32, 32, 29, 14]          --
│    │    └─GraphConvolution: 3-5                  [32, 32, 29, 14]          288
│    │    └─Sequential: 3-6                        [32, 32, 29, 14]          9,376
│    │    └─ReLU: 3-7                              [32, 32, 29, 14]          --
│    └─OneShot_STGCN_Block: 2-6                    [32, 128, 29, 14]         --
│    │    └─ModuleDict: 3-8                        --                        50,176
├─Linear: 1-3                                      [32, 2]                   514
====================================================================================================
Total params: 126,310
Trainable params: 126,310
Non-trainable params: 0
Total mult-adds (G): 1.57
====================================================================================================
Input size (MB): 0.16
Forward/backward pass size (MB): 203.53
Params size (MB): 0.48
Estimated Total Size (MB): 204.17
====================================================================================================
Parameter Size: 0.12045860 M
FLOPs: 1.64789359 G
Params(M): 0.1204300 
FLOPs(G): 1.5832627